In [23]:
import pandas as pd
from pandas.tseries.offsets import MonthBegin

In [14]:
gold_file = 'daily_gold_rate.csv'
crude_file = 'crude-oil-price.csv'
usd_file = 'rbi_usd_inr_final.csv'

In [15]:
def prepare_monthly_data(data2):
    data2['Month'] = data2['Date'].apply(lambda x: MonthBegin(0).rollback(x))
    g_data1 = data2.groupby(by='Month', as_index=False).mean()
    g_data1['Rate'] = round(g_data1['Rate'], 2)
    g_data1.rename({'Rate':'Month_Mean_Rate'}, axis=1, inplace=True)
    merge_data = pd.merge(left=data2, right=g_data1, on='Month')
    return merge_data

# Reading USD file

In [34]:
usd = pd.read_csv(usd_file)

# Reading Gold File

In [16]:
gold_df = pd.read_csv(gold_file)

In [17]:
gold_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9774 entries, 0 to 9773
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    9774 non-null   object
 1   USD     9774 non-null   float64
 2   EUR     9774 non-null   float64
 3   GBP     9774 non-null   float64
 4   INR     9774 non-null   float64
 5   AED     9774 non-null   float64
 6   CNY     9770 non-null   float64
dtypes: float64(6), object(1)
memory usage: 534.6+ KB

In [18]:
gold_df.head()

         Date     USD     EUR     GBP      INR      AED    CNY
0  1985-01-01  308.30  402.45  266.01  3825.85  1134.42    NaN
1  1985-01-02  305.50  401.49  266.00  3787.05  1134.42    NaN
2  1985-01-03  302.30  397.08  262.76  3718.88  1107.67    NaN
3  1985-01-04  303.15  397.15  262.58  3759.64  1118.21    NaN
4  1985-01-07  298.25  392.55  261.17  3741.23  1091.58  835.8

In [19]:
gold_df = gold_df[['Date', 'INR']]
gold_df.head()

         Date      INR
0  1985-01-01  3825.85
1  1985-01-02  3787.05
2  1985-01-03  3718.88
3  1985-01-04  3759.64
4  1985-01-07  3741.23

Daily gold rate from 1985 to Present per troy ounce in their national currency( 1 t oz = 31.1g). Cconeerting the rates to per grams

In [20]:
gold_df['INR'] = gold_df['INR']/31.1

In [21]:
gold_df.head()

         Date         INR
0  1985-01-01  123.017685
1  1985-01-02  121.770096
2  1985-01-03  119.578135
3  1985-01-04  120.888746
4  1985-01-07  120.296785

In [24]:
gold_df['Month'] = gold_df['Date'].apply(lambda x: MonthBegin(0).rollback(x))
g_data1 = gold_df.groupby(by='Month', as_index=False).mean()

In [25]:
g_data1.head()

       Month         INR
0 1985-01-01  122.631134
1 1985-02-01  124.423071
2 1985-03-01  124.005527
3 1985-04-01  128.665580
4 1985-05-01  125.993597

In [26]:
g_data1['INR'] = round(g_data1['INR'], 2)
g_data1.rename({'INR':'gold_rate'}, axis=1, inplace=True)

In [30]:
g_data = g_data1

In [31]:
g_data.head()

       Month  gold_rate
0 1985-01-01     122.63
1 1985-02-01     124.42
2 1985-03-01     124.01
3 1985-04-01     128.67
4 1985-05-01     125.99

# Read Crude oil data

In [32]:
crude = pd.read_csv(crude_file)

In [33]:
crude.head()

                  date  price  percentChange  change
0  1983-03-30T00:00:00  29.27            NaN     NaN
1  1983-04-04T00:00:00  30.63       4.646396    1.36
2  1983-05-02T00:00:00  30.25      -1.240614   -0.38
3  1983-06-01T00:00:00  31.38       3.735537    1.13
4  1983-07-01T00:00:00  32.00       1.975781    0.62

Crude oil price in USD/Bbl from 1983 to present. Cconverting it to INR/Bbl